Repository: korompaidani/PhotoOrganizer
Catalog: PhotoOrganizer.UI/Resources/Language/TextResources.*.resx
Languages: hu_hu

# AboutLinkText
source: My Github page:
hu_hu: Github oldalam:

# AboutText
source: I am happy to know that you are using my application. My intention was to create an app which might be a useful tool to modify photo's meta data. I think especially on that ones which have wrong data (e.g. old, scanned photos). In other hand thanks to this project I can practice coding and widen my C#, MVVM, Scipting, XAML, ORM knowledge. I hope you can use this tool as much joy as I made it with.
hu_hu: Nagy örömömre szolgál, hogy használod az alkalmazásomat. A célom vele egy olyan program megalkotása volt, amivel könnyedén és intuitíven lehet a képek metaadtait szerkeszteni mindenféle egyéb kiegészítő, de a fő célt zavaró funkciók nélkül. Másodlagos célom pedig a tanulás, amit ennek a projektnek köszönhetően nagy erőbedobással és lelkesedéssel tudtam művelni. Remélem éppen olyan nagy örömmel fogod használni a programomat, amekkora boldogságot okozott nekem a készítése.

# AboutTitle
source: Welcome to my app!
hu_hu: Üdv az Appomban!

# About_menu
source: About
hu_hu: Névjegy

# ActualSettingIs
source: The actual setting is:
hu_hu: Az aktuális beállítás:

source: Add
hu_hu: Hozzáad

source: Added Photos
hu_hu: Hozzáadott képek

# AddNewPeople_tooltip
source: Add new people to the photo. After click on it, newly created people will be automatically added to the photo. If you type an exisiting name, that one will be added instead of creating a new one. New people will be available for other photos only after save the photo which originally contains the people.
hu_hu: Hozzáadja az új személyt a képhez. Kattintás után a személy létrejön és automatikusan hozzáadódik a fotóhoz is. Miután a fénykép mentésre kerül, a személy elérhető lesz más fotók számára is.

# AddPeople_tooltip
source: You can add people who appears on the photo. It will be written as a keyword after writing metadata.
hu_hu: Itt új képen szereplő személyt adhatsz hozzá a fotóhoz. Ha kiírod a meta adatot, akkor azon kulcsszó értékként fog megjelenni.

# AddPhoto_menu
source: Add Photo...
hu_hu: Kép hozzáadása…

# AddSelectedPeople_button
source: Add selected people
hu_hu: Kijelölt személy hozzáadása

# AddSelectedPeople_tooltip
source: Add existing people to the photo.
hu_hu: Már létrehozott személy hozzáadása a képhez.

source: Add to photo
hu_hu: Képhez hozzáadás

source: Add to shelve
hu_hu: Tedd a Polcra

# AddToShelve_tooltip
source: You can put this image to the shelve. It is useful if you want to set this image data later after processing other images.
hu_hu: Feltheted a képet a "polcra". Hasznos lehet, ha később szeretnél a képpel foglalkozni, miután más képek feldolgozásából ötletet merítettél.

source: Albums
hu_hu: Albumok

source: Available photos
hu_hu: Rendelkezésre álló képek

# ButtonsTitle
source: Buttons
hu_hu: Gombok

source: Cancel
hu_hu: Mégse

# ChooseFolder_windowTitle
source: Please choose a target path for the 'backup':
hu_hu: Kérlek válaszd ki a 'biztonsági mentés' helyét:

# CloseConfirmation_message
source: You've made changes. Do you really want to close this item?
hu_hu: Változtatásaid vannak. Biztosan be szeretnéd zárni?

# CloseOpenTabs_menu
source: Close Open Tabs
hu_hu: Nyitott lapok bezárása

# ConfirmationBeforeErase_message
source: This operation will erase all previous data from Database. Are you sure to delete all data?
hu_hu: Ez a művelet minden előző adatot törölni fog az adatbázisból. Biztosan ezt szeretnéd?

source: Coordinates
hu_hu: Koordináták

# Copy_button
source: copy
hu_hu: Másol

# Copy_tooltip
source: Copy the path to the clipboard.
hu_hu: Kimásolja az útvonalat a vágólapra.

# CouldNotLoadEntity_message
source: Could not load the entity, maybe it was deleted in the meantime by another user. Tha navigation is refreshed for you.
hu_hu: Nem tudja betölteni az elemet, elképzelhető, hogy törölve lett egy párhuzamos művelet során, vagy valamilyen okból nem elérhető. A 'Navigációs Panel' frissülni fog.

# CreateBackup_menu
source: Create backup...
hu_hu: Biztonsági mentés…

# CreateNewPeople_button
source: Create new people
hu_hu: Új személy létrehozása

# CreatingBackup_message
source: Creating backup...
hu_hu: Biztonsági mentés készítése…

# CreditsText
source: Thank you for the following components/knowledge:
hu_hu: Hálás köszönet az alábbi komponensekért/megszerzett tudásért:

# CreditsTitle
source: Credits
hu_hu: Kredit

# CultureInfo_constant
source: en-US
hu_hu: hu-HU

# DataWillReloaded_message
source: The data will be reloaded. Details:
hu_hu: Az adatok újratöltődtek. Részletek:

# Data_menu
source: Data
hu_hu: Adatok

# DefaultError_message
source: {0} error happened during the process. After closing the application an error log will be generated here: {1} If something unusual happens please restart the Application!
hu_hu: {0} típusú hiba történt a feldolgozás során. A program bezárása után a hiba leírását tartalmazó fájl itt lesz megtalálható: {1} Ha ezek után bármi az alkalmazás nem a tőle várt módon viselkedne, kérlek indítsd újra a programot!

source: Delete
hu_hu: Törlés

# Description_colon
source: Description:
hu_hu: Leírás:

source: Deselect all
hu_hu: Összes kij. Megsz.

# DidntSave_errorMessage
source: {0}(id:{1}) didn't saved.
hu_hu: {0} (azonosító: {1}) nem lett elmentve.

source: Discard
hu_hu: Elvetés

source: Discard All
hu_hu: Össz. Elvetése

source: Down
hu_hu: Le

# DownPage_tooltip
source: Based on page size (you can change in setting menu) if there is content above this button is enabled.
hu_hu: Az oldal méret (amit a 'Beállítások' menüben megváltoztathatsz) és teljes tartalom függvényében betöltheted a lejebb szereplő elemeket.

# DoYouReallyWantDelete_message
source: Do you really want to delete {0}?
hu_hu: {0}-t biztosan törölni szeretnéd?

# DoYouWantBackup_message
source: Would you like to backup database first before erase all photo data?
hu_hu: Szeretnél készíteni egy 'biztonsági mentést' mielőtt törölsz mindent?

# Edit_menu
source: Edit
hu_hu: Szerkesztés

source: End
hu_hu: Vége

source: English
hu_hu: Angol

# EntityHasBeenChanged_message
source: The entity has been changed in the meantime by someone else. Click OK to save your changes anyway, click Cancel to reload the entity from the database.
hu_hu: Ez az elem időközben megváltozott egy másik párhuzamos művelet során. Kattints az 'OK'-ra, hogyha mégis ezt szeretnéd menteni, vagy kattints a 'Mégse'-re, hogy újra töltsem az elemet az adatbázisból.

# EntityHasBeenDeleted_message
source: The entity has been deleted by another user
hu_hu: Ez az elem egy párhuzamos művelet során törölve lett az adatbázisból.

# EraseAllData_menu
source: Erase all data...
hu_hu: Adatbázis törlése...

# ErrorWhileSaveEntities_errorMessage
source: Error while saving the entities,
hu_hu: Hiba az elemek mentése közben,

# Exit_menu
source: Exit
hu_hu: Kilépés

source: Extend
hu_hu: Bővítés

# ExtendOrOverwrite_message
source: The database has entry(s). Would you like to 'Extend' existing or 'Overwrite'?
hu_hu: Az adatbázisban szerepelnek bejegyzések. A meglévőt szeretnéd 'Bővíteni' vagy inkább 'Felülírod' az egészet?

# FileHasBeenModifiedFailed_message
source: File cannot be modified
hu_hu: A fájl nem módosítható

# FileHasBeenModifiedSucc_message
source: File has been succesfully modified
hu_hu: A fájl sikeresen módosult

# File_menu
source: File
hu_hu: Fájl

source: Finalize
hu_hu: Véglegesít

# Finalize_tooltip
source: It marks the image as finalized. Write metainfo doesn't take effect on finalized images until next save. It helpful if you would like to see the image in 'done' state.
hu_hu: Ezzel megjelölheted a képet véglegesként. A meta infó fájlba írása nem történik meg ezen a képen egészen a kép következő módosításáig majd mentéséig. Hasznos lehet, ha a képet 'elkészült' állapotban szeretnéd látni.

# FunctionalitiesTitle
source: Functionalities
hu_hu: Funkcionalitások

# GettingStarted_button
source: Getting started
hu_hu: Itt kezdhetsz

# GettingStarted_description
source: With this application you are able to change your favourite photo's metadata easily.. Just load your photos from folder and enjoy your work. Let's photoverse!
hu_hu: Ezzel az alkalmazással könnyedén módosíthatod a kedvenc képeid meta adatait. Ha úgy tetszik jegyzetelhetsz a képek hátoldalára, mint régen. Különösen azoknál a régi képeknél lehet hasznos, amik szkennelve lettek vagy valamilyen oknál fogva nem a kép valós adatait tartalmazzák. Csak töltsd be a fotóidat és élvezd a munkát velük. Hajrá a photoverse-eléshez!

# Help_menu
source: Help
hu_hu: Súgó

# HowToUseTitle
source: How to use this app
hu_hu: Hogyan használd az appot

source: Hungarian
hu_hu: Magyar

# Info_windowTitle
source: Info
hu_hu: Infó

source: Language
hu_hu: Nyelv

# LanguageSettingsDescription
source: You can change the display language of the application. This change will take effect after restart.
hu_hu: Itt megváltoztathatod a megjelenítés nyelvét. Ez a beállítás csak a program következő indulásakor lesz érvényes.

# Language_colon
source: Language:
hu_hu: Nyelv:

source: Location
hu_hu: Helyszínek

# LocationCantBeRemovedBecauseItIsUsedByEntity_message
source: The location {0} can't be removed, as it is referenced by at least one photo
hu_hu: A {0} helyszínt nem sikerült törölni, mivel egy vagy több fényképen használva van.

source: Location Name
hu_hu: Helyszín neve

# Locations_menu
source: Locations
hu_hu: Helyszínek

# Location_colon
source: Location:
hu_hu: Helyszín:

# Map_button
source: map
hu_hu: Térkép

source: Mark as unchanged
hu_hu: Változatlannak jelöl

# MarkAsUnchanged_tooltip
source: It marks the image as unchanged. If you do this the image meta info cannot be written until next save.
hu_hu: Megjelölheted a képet változatlanként. Ha ezt teszed, akkor a meta adatok írása hatástalan lesz erre a képre egészen annak legközelebbi módosításáig és mentéséig.

# NewAlbum_menu
source: New Album
hu_hu: Új Album

source: new place
hu_hu: Új helyszín

source: No
hu_hu: Nem

# OpenInBrowser_button
source: Open in browser
hu_hu: Megnyitás a böngészőben

# OpenInBrowser_tooltip
source: Click on it to Open the coordinates in the default internet browser
hu_hu: Kattints a koordinátákra, hogy megnézhesd a helyszínt az alapértelmezett böngészőben.

# OpenMap_tooltip
source: Open the map to pick gps coordinates for the photo. You can just simply choose a coordinate or you can save it to be able to use it later again. You can change existing saved location if it is selected in the combo box.
hu_hu: Nyisd meg a térképet és keresd ki a helyszínt, ahol a fénykép készülhetett. Szimplán választhatsz egy koordinátát de akár el is mentheted a helyszínt vagy módosíthatod a meglévőt, így a későbbiek során könnyen kiválaszthatod más képek esetén is a legördülő menüből.

# Options_menu
source: Options
hu_hu: Beállítások

source: Overwrite
hu_hu: Felülírás

# PageSizeSettingsDescription
source: The page size determines how many photo will appear in navigation bar. Memory consumtion is lower in case of lower page size.
hu_hu: Az oldalméret meghatározza, hogy egyszerre mennyi kép jelenjen meg a 'Navigációs Panelen'. Kisebb oldal méret kevesebb memória használatot és gyorsabb feldolgozást eredményez.

# PageSize_colon
source: Page size:
hu_hu: Oldal méret:

# Path_colon
source: Path:
hu_hu: Útvonal:

source: People
hu_hu: Személy

# Peoples_colon
source: Peoples:
hu_hu: Személyek:

source: Performance
hu_hu: Teljesítmény

# PhotoCantDeleted_message
source: {0} can't be deleted as it is part of at least one album.
hu_hu: {0} nem törölhető, mivel legalább egy albumhoz hozzá van adva.

source: Photos
hu_hu: Képek

# PleaseWait_windowTitle
source: Please wait
hu_hu: Kérlek várj

# Question_windowTitle
source: Question
hu_hu: Kérdés

# ReadingFiles_message
source: Reading files...
hu_hu: Fájlok beolvasása…

# ReadPhotoLibrary_menu
source: Read Photo Library...
hu_hu: Könyvtár hozzáadása...

source: Remove
hu_hu: Eltávolít

source: Remove from shelve
hu_hu: Vedd le a Polcról

# RemoveFromShelve_tooltip
source: This button removes the image from the shelve.
hu_hu: Ez a gomb eltávolítja a képet a polcról. Vedd le, ha már nincsen szükséged rá, hogy továbbra is ott legyen.

# RemovePeopleFromDb_button
source: Remove from database
hu_hu: Személy törlése

# RemovePeople_tooltip
source: This people will be removed from the photo after click on it.
hu_hu: Ez a személy le lesz véve a fotóról ha a nevére kattintasz. Az adatbázisból nem törlődik.

# RemoveSelectedPeople_button
source: Remove selected
hu_hu: Kijelölt törlése

# RemoveSelectedPeople_tooltip
source: Remove selected people from the database. If you remove it, it takes effect for other photos.
hu_hu: Személy törlése az adatbázisból. Ha itt törlöd, akkor törlődik az összes képről, ahol szerepelt.

source: Save
hu_hu: Mentés

source: Save All
hu_hu: Össz. Mentése

# SaveAllTab_menu
source: Save All Tab
hu_hu: Nyitott lapok mentése

source: Save As New
hu_hu: Mentés újként

# SaveAsNew_tooltip
source: Save location and coordinates in the database. You can use it in case of other photos in the future.
hu_hu: Mentsd el a helyszín nevét és koordinátái az adatbázisba új elemként. Így más fényképek esetén is könnyedén hozzáadhatod a helyszínt a térkép megnyitása nélkül a legördülő menü használatával.

# SaveDialog_windowTitle
source: Save Dialog
hu_hu: Mentés párbeszédablak

# SaveDiscardItemByTitle_message
source: Do you want to save {0}?
hu_hu: {0}-t szeretnéd menteni?

source: Save Existing
hu_hu: Meglévő felülírása

# SaveExisting_tooltip
source: It overrides existing location in database and also set and save coordinates.
hu_hu: Felülírja a meglévő helyszínt az itt kitöltöttel és koordinátáit a kiválasztott helyszínnel. Ha nincs kiválasztva semmi a térképen, akkor nem fog hozzá értelmes koordinátát társítani, de hibát nem okoz.

# SaveWindowMessage
source: Do you want to save opened tabs before close?
hu_hu: Kilépés előtt szeretnéd menteni a megnyitott lapokat?

# Save_tooltip
source: Save changes on actual tab
hu_hu: Az aktuális lap változtatásainak mentése

source: Select all
hu_hu: Mindet

source: Select/Deselect all
hu_hu: Mindet/Semmit

# SelectDeselectAll_tooltip
source: Select/Deselect all visible tiles
hu_hu: Minden látható csempét kijelöl vagy visszavonja a kijelölést.

source: Select finalized
hu_hu: Véglegesek

# SelectFinalized_tooltip
source: Select only finalized tiles
hu_hu: Csak a véglegesített csempék kijelölése

# SelectPhotoLocation_message
source: Please select a 'photo' location:
hu_hu: Válassz egy fotókat tartalmazó mappát (almappák is feldolgozásra kerülnek):

# SelectPhoto_message
source: Please select a photo
hu_hu: Kérlek válassz egy fényképet

# SelectPrevious
source: Previous
hu_hu: Korábban jelöltek

# SelectPrevious_tooltip
source: Select/Deselect previously selected tiles (works only after any set)
hu_hu: Kijelöli a korábban megjelölt csempéket. Csak azután működik, ha már a tömbös beállítás használva volt.

source: Select saved
hu_hu: Mentettek

# SelectSaved_tooltip
source: Select only saved tiles
hu_hu: Csak az elmentett elmeket jelöli ki

source: Select unmodified
hu_hu: Változatlanok

# SelectUnmodified_tooltip
source: Select only unmodified tiles
hu_hu: Csak azokat jelöli ki, amelyek még nem lettek módosítva

source: Set all
hu_hu: Mindent tömbösen

# SetAll_tooltip
source: All actual data will overrite the selected image(s) in the navigation bar.
hu_hu: Az adott lap minden módosítható adata érvényesítve lesz a 'Navigációs Panelen' kijelölt csempéken, azok vonatkozó adatainak felülírásával.

source: Set Coordinate
hu_hu: Koordináta beállítása

# SetCoordinates_button
source: Set coordinates
hu_hu: Csak koordináta

# SetCoordinates_tooltip
source: You can set the coordinate without saving the location to the database.
hu_hu: Csak a koordinátát állítja be anélkül, hogy a helyszínt magát elmentené az adatbázisba. Célszerű ezt választani a nem túl gyakran használt helyszínek esetén. Így nem duzzad átláthatalan nagyságúra a legördülő menü.

# Settings_menu
source: Settings
hu_hu: Konfiguráció

# Set_button
source: set
hu_hu: tömb

# Set_tooltip
source: Actual data in the line will overrite the same entry of selected image(s) in the navigation bar.
hu_hu: A sorban szereplő adat beállításra kerül a 'Navigációs Panelen' kijelölt csempéken azok érintett adatának felülírásával.

source: Shelve
hu_hu: Polc

# TakenDate_colon
source: Taken Date:
hu_hu: Készítés ideje:

# TheSelectedPathInvalid_message
source: The selected path is invalid, would you like to try again?
hu_hu: A kiválasztott útvonal érvénytelen, szeretnéd újra megpróbálni?

source: Title
hu_hu: Cím

# Title_colon
source: Title:
hu_hu: Cím:

# TypeName
source: Type a name here:
hu_hu: Írj egy nevet ide…

# UnhandledExceptionOccurred_errorMessage
source: An unhandled exception occurred: {0}
hu_hu: Egy nem várt hiba történt az alábbi üzenettel: {0}

source: Up
hu_hu: Fel

# UpPage_tooltip
source: Based on page size (you can change in setting menu) if there is content below this button is enabled.
hu_hu: Oldal méret (ez változtatható a beállítások alatt) és a képek számának függvényében felfelé lapoz, ha van ott tartalom.

# ViewHelp_menu
source: View help
hu_hu: Súgó megtekintése

# Warning_windoTitle
source: Warning
hu_hu: Figyelmeztetés

# Window_menu
source: Window
hu_hu: Ablak

source: Write metadata
hu_hu: Meta adat írása

# WriteMetadata_tooltip
source: Write actual displayed data directly to image the image file. Only the saved pictures (yellow) will be written.
hu_hu: Az aktuális lapon megadott adatokat beleírja a képfájlba. Csak egy már korábban mentett lapon érhető el a funkció.

# WriteSavedItemsMetadata_menu
source: Write Saved Items Metadata
hu_hu: Minden Mentett Kép Meta Adatának Írása

# WritingMetadata_message
source: Writing image metadata...
hu_hu: Meta adatok írása…

# WritingToFileDialog_windowTitle
source: Writing To File
hu_hu: Fájlok Írása

source: Yes
hu_hu: Igen
